<div style="background-color: lightgray; padding: 18px;">
    <h1> Learning Python | Day 18
    
</div>

### Features:
Pandas
- Transformation in DataFrames (apply);
- ETL and missing values;
- Data exploration (EDA);
- Exercices;

<div style="background-color: lightgreen; padding: 10px;">
    <h2> Transformation in DataFrames
</div>

A very useful and widely used feature, whether for transforming dataframes or creating ``derived columns`` in dataframes, is the `apply` function. We can use the `apply` function in conjunction with what we call a lambda function. This can include a function defined elsewhere in our code or not.

In [2]:
import pandas as pd

data = {
    'altura': [1.69, 1.50, 1.58, 1.69, 1.74, 1.73],
    'peso': [77.2, 68.0, 65.0, 85.0, 78.6, 69.2]
}

df = pd.DataFrame(data)
df

   altura  peso
0    1.69  77.2
1    1.50  68.0
2    1.58  65.0
3    1.69  85.0
4    1.74  78.6
5    1.73  69.2

In [3]:
# One possibility:

df['altura_ao_quadrado'] = df['altura']**2
df['imc'] = df['peso'] / df['altura_ao_quadrado']
df

   altura  peso  altura_ao_quadrado        imc
0    1.69  77.2              2.8561  27.029866
1    1.50  68.0              2.2500  30.222222
2    1.58  65.0              2.4964  26.037494
3    1.69  85.0              2.8561  29.760863
4    1.74  78.6              3.0276  25.961157
5    1.73  69.2              2.9929  23.121387

In [7]:
# Another possibility using apply(): ~ it means, for each row, apply ...

df['imc2'] = df.apply(lambda row: row['peso'] / (row['altura'] ** 2), axis=1) 
df

   altura  peso  altura_ao_quadrado        imc       imc2       imc3
0    1.69  77.2              2.8561  27.029866  27.029866  27.029866
1    1.50  68.0              2.2500  30.222222  30.222222  30.222222
2    1.58  65.0              2.4964  26.037494  26.037494  26.037494
3    1.69  85.0              2.8561  29.760863  29.760863  29.760863
4    1.74  78.6              3.0276  25.961157  25.961157  25.961157
5    1.73  69.2              2.9929  23.121387  23.121387  23.121387

In [6]:
# Another possibility using functions:

def calc_imc(row):
    return row['peso'] / (row['altura'] ** 2)

# Aplicar a função usando apply
df['imc3'] = df.apply(lambda row: calc_imc(row), axis=1)
df

   altura  peso  altura_ao_quadrado        imc       imc2       imc3
0    1.69  77.2              2.8561  27.029866  27.029866  27.029866
1    1.50  68.0              2.2500  30.222222  30.222222  30.222222
2    1.58  65.0              2.4964  26.037494  26.037494  26.037494
3    1.69  85.0              2.8561  29.760863  29.760863  29.760863
4    1.74  78.6              3.0276  25.961157  25.961157  25.961157
5    1.73  69.2              2.9929  23.121387  23.121387  23.121387

---
**Note:**

The `axis` parameter in the Pandas `apply()` function is used to specify the direction along which the function will be applied. 

When `axis=1`, the function will be applied along the columns (i.e., for each row), while when `axis=0`, the function will be applied along the rows (i.e., for each column).

<div style="background-color: lightgreen; padding: 10px;">
    <h2> ETL and missing values
</div>

It is very common in a ``dataset``, whether it comes from a database or a ``CSV`` file, to have ``null`` values (i.e., invalid or empty values).

For analysis or modeling purposes, it is crucial to identify the occurrence of these values and make a decision, whether to **remove** the null values or replace them. We will see below how to do both.

- Identifying Null Elements by Column: Identifying the number of null values per column is very important, as it helps us determine the most appropriate action.

In [10]:
import pandas as pd
import numpy as np

data = {
    'altura': ['a', 'b', 'c', None],
    'peso': [77.2, np.nan, 85.0, 78.6],
    'nomes': ['Fulano', 'Sicrana', 'Beltrana', 'João']
}
index = ['b', 'a', 'c', 'f']

df = pd.DataFrame(data, index=index)
df

  altura  peso     nomes
b      a  77.2    Fulano
a      b   NaN   Sicrana
c      c  85.0  Beltrana
f   None  78.6      João

In [11]:
df.isna().sum()

altura    1
peso      1
nomes     0
dtype: int64

In [12]:
df.isnull().sum()

altura    1
peso      1
nomes     0
dtype: int64

In [14]:
df.dropna()

  altura  peso     nomes
b      a  77.2    Fulano
c      c  85.0  Beltrana

---

In other words, it **removed** all rows containing any null values.

- Replacing Null Values: As we often do not want to reduce the size of our dataset, one approach is to replace these values (either with the mean, mode, etc.).

To do this, we can use the ``fillna`` method, where the passed parameter will be the replacement value. In this example, we will replace the values with -1, but it could be any other value.

In [15]:
df

  altura  peso     nomes
b      a  77.2    Fulano
a      b   NaN   Sicrana
c      c  85.0  Beltrana
f   None  78.6      João

In [16]:
df = df.fillna(-1)
df

  altura  peso     nomes
b      a  77.2    Fulano
a      b  -1.0   Sicrana
c      c  85.0  Beltrana
f     -1  78.6      João

In [19]:
# another way:

df.replace(-1, 60)

  altura  peso     nomes
b      a  77.2    Fulano
a      b  60.0   Sicrana
c      c  85.0  Beltrana
f     60  78.6      João

---
The ``fillna()`` method replaces the NULL values with a specified value.

The ``fillna()`` method returns a new DataFrame object unless the inplace parameter is set to True, in that case the fillna() method does the replacing in the original DataFrame instead.

*Syntax:*
``` python
dataframe.fillna(value, method, axis, inplace, limit, downcast)

In [82]:
import pandas as pd
import numpy as np

data = {
    'altura': [171, 200, 160, None],
    'peso': [77.2, np.nan, 85.0, 78.6],
    'nomes': ['Fulano', 'Sicrana', 'Beltrana', 'João']
}
index = ['b', 'a', 'c', 'f']

df = pd.DataFrame(data, index=index)
df

   altura  peso     nomes
b   171.0  77.2    Fulano
a   200.0   NaN   Sicrana
c   160.0  85.0  Beltrana
f     NaN  78.6      João

In [84]:
df = df.fillna(df.mean())
df

C:\Users\Andre\AppData\Local\Temp\ipykernel_11412\983163164.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df = df.fillna(df.mean())

   altura       peso     nomes
b   171.0  77.200000    Fulano
a   200.0  80.266667   Sicrana
c   160.0  85.000000  Beltrana
f   177.0  78.600000      João

<div style="background-color: lightgreen; padding: 10px;">
    <h2>  Data exploration (EDA)
</div>

Python is a great language for doing ``data analysis``, primarily because of the fantastic ecosystem of data-centric Python packages. Pandas is one of those packages and makes importing and analyzing data much easier. 

We can leverage Pandas to assist in ``data exploration``. There are various methods to help us summarize data and calculate some descriptive statistics.

As an example, we can calculate the ``mean`` of each column in a dataframe.

Sources:
- https://www.geeksforgeeks.org/python-pandas-dataframe-describe-method/
- https://www.geeksforgeeks.org/adding-new-column-to-existing-dataframe-in-pandas/
- https://www.geeksforgeeks.org/pandas-groupby/
- https://www.geeksforgeeks.org/pandas-built-in-data-visualization-ml/

In [85]:
data = {
    'altura': [1.69, 1.50, 1.58, 1.69, 1.74, 1.73],
    'peso': [77.2, 68.0, 65.0, 85.0, 78.6, 69.2]
}
df = pd.DataFrame(data)
df

   altura  peso
0    1.69  77.2
1    1.50  68.0
2    1.58  65.0
3    1.69  85.0
4    1.74  78.6
5    1.73  69.2

In [86]:
df.mean()

altura     1.655000
peso      73.833333
dtype: float64

In [87]:
df.min()

altura     1.5
peso      65.0
dtype: float64

In [88]:
df.max()

altura     1.74
peso      85.00
dtype: float64

---
Pandas ``describe()`` is used to view some basic statistical details like percentile, mean, std, etc. of a data frame or a series of numeric values. When this method is applied to a series of strings, it returns a different output which is shown in the examples below:
```
count: Total Number of Non-Empty values
mean: Mean of the column values
std: Standard Deviation of the column values
min: Minimum value from the column
25%: 25 percentile
50%: 50 percentile
75%: 75 percentile
max: Maximum value from the column

In [89]:
df.describe()

         altura       peso
count  6.000000   6.000000
mean   1.655000  73.833333
std    0.094816   7.645565
min    1.500000  65.000000
25%    1.607500  68.300000
50%    1.690000  73.200000
75%    1.720000  78.250000
max    1.740000  85.000000

---

When conducting analyses on a dataset, it is very useful to know some behaviors separated by **groups**. 

For this, we use the `groupby` function associated with some aggregation function.

``Groupby`` is a pretty simple concept. We can create a grouping of categories and apply a function to the categories. It’s a simple concept but it’s an extremely valuable technique that’s widely used in data science. In real data science projects, you’ll be dealing with large amounts of data and trying things over and over, so for efficiency, we use Groupby concept.

In [90]:
data = {
    'categoria': ['eletrônicos', 'eletrônicos', 'vestuário', 'vestuário', 'acessórios'],
    'valor_venda': [1000, 1500, 800, 1200, 500]
}
df_vendas = pd.DataFrame(data)
df_vendas

     categoria  valor_venda
0  eletrônicos         1000
1  eletrônicos         1500
2    vestuário          800
3    vestuário         1200
4   acessórios          500

In [92]:
df_vendas.groupby('categoria').sum()

             valor_venda
categoria
acessórios           500
eletrônicos         2500
vestuário           2000

In [93]:
df_vendas.groupby('categoria').mean()

             valor_venda
categoria
acessórios         500.0
eletrônicos       1250.0
vestuário         1000.0

---

In [94]:
# Another example:

data = {
    'altura': [1.69, 1.50, 1.58, 1.69, 1.74, 1.73],
    'peso': [77.2, 68.0, 65.0, 85.0, 78.6, 69.2],
    'genero': [0.0, 0.0, 0.0, 1.0, 1.0, 1.0],
    'carioca': [1, 0, 1, 0, 1, 0]
}

df = pd.DataFrame(data)
df

   altura  peso  genero  carioca
0    1.69  77.2     0.0        1
1    1.50  68.0     0.0        0
2    1.58  65.0     0.0        1
3    1.69  85.0     1.0        0
4    1.74  78.6     1.0        1
5    1.73  69.2     1.0        0

In [95]:
df.describe()

         altura       peso    genero   carioca
count  6.000000   6.000000  6.000000  6.000000
mean   1.655000  73.833333  0.500000  0.500000
std    0.094816   7.645565  0.547723  0.547723
min    1.500000  65.000000  0.000000  0.000000
25%    1.607500  68.300000  0.000000  0.000000
50%    1.690000  73.200000  0.500000  0.500000
75%    1.720000  78.250000  1.000000  1.000000
max    1.740000  85.000000  1.000000  1.000000

In [96]:
df[['genero', 'altura', 'peso']].groupby('genero').mean()

        altura       peso
genero
0.0       1.59  70.066667
1.0       1.72  77.600000

In [97]:
df[['carioca', 'altura', 'peso']].groupby('carioca').mean()

         altura       peso
carioca
0          1.64  74.066667
1          1.67  73.600000

In [98]:
df.groupby(['genero', 'carioca']).mean()

                altura  peso
genero carioca
0.0    0         1.500  68.0
       1         1.635  71.1
1.0    0         1.710  77.1
       1         1.740  78.6

In [99]:
df.pivot_table(index = 'genero', columns = 'carioca', values = 'peso', aggfunc = np.mean)

carioca     0     1
genero
0.0      68.0  71.1
1.0      77.1  78.6

In [100]:
df.pivot_table(index = 'genero', columns = 'carioca', values = 'altura', aggfunc = np.mean)

carioca     0      1
genero
0.0      1.50  1.635
1.0      1.71  1.740

<div style="background-color: lightgreen; padding: 10px;">
    <h2>  Exercices:
</div>

---

#### <font color="blue">Exercice 1</font>

A supermarket wants to analyze the sales performance of products in different regions. They have the following sales record that contains information about the product, the quantity sold, and the region where it was sold. Create a DataFrame with this data and filter it to show only the sales made in the 'Southeast' region.

Product: shirt <br>
100 sales for the Southeast region.

Product: pants<br>
150 sales for the Northeast region.

Product: sneakers<br>
80 sales for the Southeast region.

Product: cap<br>
120 sales for the North region.

Product: backpack<br>
90 sales for the Southeast region.

---

#### <font color="blue">Exercice 2</font>

An e-commerce company is interested in understanding the buying behavior of customers. They have the following transaction record that contains information about the purchase amount and the payment method used. Create a DataFrame with this data and calculate basic statistics such as mean, median, minimum, and maximum for each column.

In [101]:
dados = {
    'valor_compra': [100.0, 150.5, 80.3, 120.8, 90.2],
    'metodo_pagamento': ['Cartão', 'Boleto', 'Cartão', 'Cartão', 'Boleto']
}

---

#### <font color="blue">Exercice 3</font>

A research institute collected data on the academic performance of students in different subjects. They have a record of student grades that contains information about the student's name, the subject, the obtained grade, and the difficulty level of the subject. Create a DataFrame with this data and group it by subject to calculate the average grades obtained by students. Then, create a new column indicating whether the student's grade is above or below the subject's average (try using the apply function).

In [102]:
dados = {
    'aluno': ['Ana', 'João', 'Maria', 'Pedro', 'Carla'],
    'disciplina': ['Matemática', 'Português', 'Matemática', 'Português', 'Ciências'],
    'nota': [8, 7, 6, 9, 8],
    'dificuldade': ['Alta', 'Baixa', 'Alta', 'Baixa', 'Média']
}